Revit 2027 API
BuiltInFailures.DimensionFailures.CannotConstrainBasePointAlignments Property
 Alignments to base points cannot be constrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConstrainBasePointAlignments { get; }
Public Shared ReadOnly Property CannotConstrainBasePointAlignments As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConstrainBasePointAlignments {
	FailureDefinitionId^ get ();
}
static member CannotConstrainBasePointAlignments : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace